app/controllers/comments_controller.rb

	def create
    plan = Plan.find(params[:plan_id])
	  comment = current_user.comments.new(comment_params)
    comment.plan_id = plan.id
      if comment.save
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "plan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "q"], ["user_id", 1], ["plan_id", 1], ["created_at", "2020-08-05 07:10:14.233135"], ["updated_at", "2020-08-05 07:10:14.233135"]]

  def destroy
    Comment.find_by(id: params[:id], plan_id: params[:plan_id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."plan_id" = ? LIMIT ?  [["id", 1], ["plan_id", 1], ["LIMIT", 1]]