app/controllers/homes_controller.rb

SELECT "plans".* FROM "plans"
---
def top
	 @plans = Plan.all