app/controllers/likes_controller.rb

  def create
    @plan = Plan.find(params[:plan_id])
    @like = current_user.likes.create(plan_id: params[:plan_id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "likes" ("plan_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plan_id", 3], ["user_id", 3], ["created_at", "2020-08-04 15:45:44.115435"], ["updated_at", "2020-08-04 15:45:44.115435"]]

  def destroy
    @plan = Plan.find(params[:plan_id])
    @like = Like.find_by(plan_id: params[:plan_id], user_id: current_user.id)
    @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."plan_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["plan_id", 3], ["user_id", 3], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]