app/controllers/markers_controller.rb

SELECT "markers".* FROM "markers"
---
  def index
    @markers = Marker.all