app/controllers/plans_controller.rb

  def create
  @plan = Plan.new(plan_params)
  @plan.user_id = current_user.id
   if @plan.save
           redirect_to plans_path
          else
            @plans = Plan.all
---
INSERT INTO "plans" ("image_id", "price", "title", "introduction", "place_name", "place_introduction", "user_id", "time", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "plans".* FROM "plans"

def show
    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
  @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def edit
    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def update
  	@plan = Plan.find(params[:id])
  	@plan.update(plan_params)
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "plans" SET "title" = ?, "image_id" = ?, "introduction" = ?, "place_name" = ?, "place_introduction" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["title", "同窓会"], ["image_id", nil], ["introduction", "パスポート持参"], ["place_name", "田中の家"], ["place_introduction", "お金持参"], ["updated_at", "2020-08-07 05:42:58.492249"], ["id", 2]]

  def destroy
    plan = Plan.find(params[:id]) #データ(レコード)を1件取得
          plan.destroy #データ（レコード）を削除
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 5]]