app/controllers/plans_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."plan_id" = ?  [["plan_id", 3]]
SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."plan_id" = ?  [["plan_id", 1]]
---
  def show
    @plan = Plan.find(params[:id])
    @user = @plan.user
    @like = Like.new
    @comment = Comment.new
    @comments = @plan.comments.page(params[:page]).per(2)