app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", nil], ["name", "uuu"], ["updated_at", "2020-08-08 16:36:30.211414"], ["id", 1]]
---
  def update
    @user = User.find(current_user.id)
    if @user.update(user_params)

UPDATE "users" SET "is_withdrawal" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_withdrawal", 1], ["updated_at", "2020-08-03 10:49:17.665588"], ["id", 4]]
---
  def hide
    @user = current_user
    @user.update(is_withdrawal: true)