app/models/user.rb

 def already_liked?(plan)
    self.likes.exists?(plan_id: plan.id)
---
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."plan_id" = ? LIMIT ?  [["user_id", 3], ["plan_id", 3], ["LIMIT", 1]]