app/views/plans/_index.html.erb

  <div class="text text01">
    <%= f.select :word, Plan.words.keys, {}, {class: 'hoge'} %>
---
SELECT "plans".* FROM "plans" WHERE (title LIKE '京%')