app/views/plans/index.html.erb

SELECT "plans".* FROM "plans"
---
  <div class="text text01">
    <%= f.select :word, Plan.words.keys, {}, {class: 'hoge'} %>