app/views/plans/show.html.erb

    <div id="iine_box" class="iine_box">
     <h3>いいね件数: <%= @plan.likes.count %></h3>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."plan_id" = ?  [["plan_id", 2]]

  <div id="comment_box" class="comment_box">
     <% @plan.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."plan_id" = ?  [["plan_id", 1]]