app/views/plans/show.html.erb

  <div id="comment_box" class="comment_box">
     <% @plan.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."plan_id" = ?  [["plan_id", 1]]